import os
from dotenv import load_dotenv

load_dotenv()

# Конфигурация бота
BOT_TOKEN = "8564056187:AAFp3wRhxS0QNZH4hmadjKLuYwsAbA2koG8
CHANNEL_ID = -1001140244688

# Настройки базы данных
DATABASE_PATH = "bot_database.db"

# Временные интервалы для задержек
DELAY_OPTIONS = [
    "0 секунд", "30 секунд", "1 минута", "2 минуты", "3 минуты", "5 минут",
    "10 минут", "15 минут", "30 минут", "1 час", "2 часа", "3 часа",
    "6 часов", "12 часов", "24 часа", "Ввести вручную"
]

# Временные интервалы для автоприема
AUTO_ACCEPT_DELAYS = [
    "30 секунд", "1 минута", "2 минуты", "5 минут", "10 минут", "15 минут",
    "30 минут", "1 час", "2 часа", "3 часа", "6 часов", "12 часов", "24 часа", "Ввести вручную"
]
